Documents/бит_ЗаявкаНаВыполнениеРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ЗаявкаНаВыполнениеРабот</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_РасходМатериаловПоВыполненнымРаботам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУдобноеДляЗаказчика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяФактическогоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КатегорииРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийПоВыполнению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный (диспетчер)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаВыполнение</Name>
					<Comment>Ответственный за выполнение (мастер)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценкаВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ОценкиВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Просрочена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализацияТоваровУслуг</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВыполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребованиеНакладная</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТребованиеНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентНормы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_НормыТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Работы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НарядЗаказ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Работы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_РегистрацияИзмененийЗаявкиНаРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_РегистрацияИзмененийЗаявкиНаРаботы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусВыполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыВыполнения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаВыполнениеРабот</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ЗаявкаНаВыполнениеРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидыОбъектовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Здание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицевойСчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_ЗаявкаНаВыполнениеРабот/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

Перем мВалютаРегламентированногоУчета Экспорт;// Хранит валюту регламентированного учета.

Перем мСтатусВыполнения Экспорт; // Хранит статус выполнения. 

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

#Если Клиент Тогда
// Функция формирует табличный документ заявки.
Функция ПечатьНарядЗаказ(ИмяМакета)
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	бит_ЗаявкаНаВыполнениеРабот.Номер,
		|	бит_ЗаявкаНаВыполнениеРабот.Дата,
		|	бит_ЗаявкаНаВыполнениеРабот.Организация,
		|	бит_ЗаявкаНаВыполнениеРабот.ВидОбъекта,
		|	бит_ЗаявкаНаВыполнениеРабот.ОбъектУчета,
		|	бит_ЗаявкаНаВыполнениеРабот.ТекстЗаявки,
		|	бит_ЗаявкаНаВыполнениеРабот.Телефон,
		|	бит_ЗаявкаНаВыполнениеРабот.ОтветственныйЗаВыполнение,
		|	бит_ЗаявкаНаВыполнениеРабот.Ответственный,
		|	бит_ЗаявкаНаВыполнениеРабот.Адрес
		|ИЗ
		|	Документ.бит_ЗаявкаНаВыполнениеРабот КАК бит_ЗаявкаНаВыполнениеРабот
		|ГДЕ
		|	бит_ЗаявкаНаВыполнениеРабот.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Работы.Работа
		|ИЗ
		|	Документ.бит_ЗаявкаНаВыполнениеРабот.Работы КАК Работы
		|ГДЕ
		|	Работы.Ссылка = &ТекущийДокумент";
		
		ЗапросПоРаботам = Запрос.Выполнить();
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НарядЗаказ.Номенклатура.Код КАК Код,
		|	НарядЗаказ.Номенклатура КАК Материал,
		|	НарядЗаказ.ЕдиницаИзмерения КАК ЕдИзм,
		|	НарядЗаказ.КоличествоПлан КАК КолвоПлан,
		|	НарядЗаказ.Количество КАК КолвоФакт,
		|	НарядЗаказ.Цена КАК Цена,
		|	НарядЗаказ.СуммаПлан КАК СуммаПлан,
		|	НарядЗаказ.Сумма КАК СуммаФакт
		|ИЗ
		|	Документ.бит_ЗаявкаНаВыполнениеРабот.НарядЗаказ КАК НарядЗаказ
		|ГДЕ
		|	НарядЗаказ.Ссылка = &ТекущийДокумент";
		
		ЗапросПоНоменклатуре = Запрос.Выполнить();
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НарядЗаказ";
		
		// Вывод заголовка.
		Макет = ПолучитьМакет(ИмяМакета);
		ОблШапка = Макет.ПолучитьОбласть("Шапка");
		
		ОблШапка.Параметры.ДатаДокумента  = ВРег(Формат(Шапка.Дата, "ДЛФ=Д"));
		ОблШапка.Параметры.Организация    = Шапка.Организация;
		
		Если ВидОбъекта = Перечисления.бит_ВидыОбъектовУчета.ЛицевойСчет Тогда
			ОблШапка.Параметры.Заказчик   = Строка(Шапка.ОбъектУчета) + ", " + Шапка.Адрес + ", " + Шапка.Телефон;
		Иначе
			ОблШапка.Параметры.Заказчик   = Строка(Шапка.ОбъектУчета);
		КонецЕсли;
		
		ОблШапка.Параметры.ТекстЗаявки    = СтрЗаменить(Шапка.ТекстЗаявки, Символы.ПС, " ");
		ОблШапка.Параметры.Ответственный  = Шапка.Ответственный;
		ОблШапка.Параметры.ОтветственныйЗаВыполнение = Шапка.ОтветственныйЗаВыполнение;
		
		ТабДокумент.Вывести(ОблШапка);
		
		ВыборкаПоРаботам = ЗапросПоРаботам.Выгрузить();
		ВыборкаПоРаботам.Свернуть("Работа");
		
		Для Каждого СтрокаТЧ Из ВыборкаПоРаботам Цикл
			
			Область = Макет.ПолучитьОбласть("Работа");
			Область.Параметры.Заполнить(СтрокаТЧ);
			ТабДокумент.Вывести(Область);
			
		КонецЦикла;
		
		// Вывод шапки таблицы.
		ОблШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабДокумент.Вывести(ОблШапкаТаблицы);
		
		ВыборкаПоСтрокам = ЗапросПоНоменклатуре.Выгрузить();
		ВыборкаПоСтрокам.Свернуть("Материал, Код, ЕдИзм, Цена", "КолвоПлан,КолвоФакт, СуммаПлан, СуммаФакт");
		ИтогоСуммаПлан = 0;
		ИтогоСуммаФакт = 0;
		
		Для Каждого СтрокаТЧ Из ВыборкаПоСтрокам Цикл
			
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Заполнить(СтрокаТЧ);
			ТабДокумент.Вывести(Область);
			ИтогоСуммаПлан = ИтогоСуммаПлан + СтрокаТЧ.СуммаПлан;
			ИтогоСуммаФакт = ИтогоСуммаФакт + СтрокаТЧ.СуммаФакт;
			
		КонецЦикла;
		
		// Вывод итогов.
		ОблИтогТаблицы = Макет.ПолучитьОбласть("Итог");
		ОблИтогТаблицы.Параметры.ИтогоСуммаПлан = ИтогоСуммаПлан;
		ОблИтогТаблицы.Параметры.ИтогоСуммаФакт = ИтогоСуммаФакт;
		ТабДокумент.Вывести(ОблИтогТаблицы);
		
		// Вывод подвала.
		Область = Макет.ПолучитьОбласть("Подвал");
		ТабДокумент.Вывести(Область);
		
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабДокумент.АвтоМасштаб = Истина;
		
		Возврат ТабДокумент;
		
КонецФункции
	
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
// Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  ИмяМакета    - Строка - название макета
//  КоличествоЭкземпляров - Число - количество экземпляров на печать
//  НаПринтер    - Булево - если Истина, то выводим сразу на принтер
//  НепосредственнаяПечать - Булево - для режима вывода на принтер
//                 печатать сразу или выводить диалог перед печатью.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
		
		// Получить экземпляр документа на печать.
		Если ИмяМакета = "НарядЗаказ" Тогда
			
			ТабДокумент = ПечатьНарядЗаказ(ИмяМакета);
			
		КонецЕсли;
		
КонецПроцедуры
	
#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("НарядЗаказ", "Наряд-Заказ");
	
КонецФункции

// Функция фозвращает дату долга:
//
// Параметры
//  Организация  - СправочникСсылка - фильтр к запросу,
//  Дата         - Дата             - фильтр к запросу.
//
// Возвращаемое значение:
//   Дата   - текущая дата долга.
//
Функция ПолучитьДатуДолга(Организация, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -(ВЫБОР
	|				КОГДА ДЕНЬ(&Дата) > бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ + бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени)), МЕСЯЦ) КАК Дата
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата"       , Дата);
	
	Возврат ?(Запрос.Выполнить().Пустой(), ТекущаяДата(),Запрос.Выполнить().Выгрузить()[0].Дата);
	
КонецФункции

Функция ВывестиСуммуДолгаПоЛС() Экспорт
	
	ДатаДолга = ПолучитьДатуДолга(Организация, Дата);
	
	// Определим сумму долга по начислениям для текущего лицевого счета.
	ЗапросПоНачислениям = Новый Запрос;
	ЗапросПоНачислениям.УстановитьПараметр("КонецПериода", КонецДня(Дата));
	ЗапросПоНачислениям.УстановитьПараметр("ЛицевойСчет",  ОбъектУчета);
	ЗапросПоНачислениям.УстановитьПараметр("ДатаДолга",    ДатаДолга);
	ЗапросПоНачислениям.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Долг.СуммаОстаток, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(Долг.СуммаОстаток, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0)
	|	КОНЕЦ КАК Долг
	|ИЗ
	|	(ВЫБРАТЬ
	|		бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|		СУММА(бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток) КАК СуммаОстаток
	|	ИЗ
	|		РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&ДатаДолга {(&ДатаДолга)}, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет) КАК Долг
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|			СУММА(ВЫБОР
	|					КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|						ТОГДА -бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|				КОНЕЦ) КАК Оплата
	|		ИЗ
	|			РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(НАЧАЛОПЕРИОДА(&ДатаДолга, МЕСЯЦ) {(&ДатаДолга)}, &КонецПериода {(&КонецПериода)}, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОбороты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет) КАК ОплатаСДатыДолга
	|		ПО Долг.ЛицевойСчет = ОплатаСДатыДолга.ЛицевойСчет";
	
	Долг = 0;
	
	Выборка = ЗапросПоНачислениям.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Долг = Выборка.Долг;
	КонецЕсли;
	
	Если Долг > 0 Тогда
		ИнфСтрока = "Долг = " + Строка(Долг);
		ЦветНадписи = Новый Цвет(255, 0, 0); // красный.
	ИначеЕсли Долг < 0 Тогда
		ИнфСтрока = "Переплата = " + Строка(-Долг);
		ЦветНадписи = Новый Цвет(0, 0, 128); // синий.
	Иначе
		ИнфСтрока = "";
		ЦветНадписи = Новый Цвет(0, 0, 0);
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СтрокаДолга", ИнфСтрока);
	СтруктураВозврата.Вставить("ЦветНадписи", ЦветНадписи);
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если мСтатусВыполнения <> СтатусВыполнения Тогда
		РегистрацияИзмененийЗаявки = РегистрыСведений.бит_РегистрацияИзмененийЗаявкиНаРаботы;
		НаборДанных = РегистрацияИзмененийЗаявки.СоздатьНаборЗаписей();
		НаборДанных.Отбор.ЗаявкаНаВыполнениеРабот.Установить(Ссылка);
		НаборДанных.Отбор.Период.Установить(ТекущаяДата());
		Если НаборДанных.Количество() = 0 Тогда
			НовыйНабор = НаборДанных.Добавить();
			НовыйНабор.Период = ТекущаяДата();
			НовыйНабор.ЗаявкаНаВыполнениеРабот = Ссылка;
		ИначеЕсли НаборДанных.Количество() = 1 Тогда
			НовыйНабор = НаборДанных[0];
		Иначе
			Текст = "ru = ""Статус выполнения регистрируется с точностью до секунды."";";
			#Если Клиент Тогда
				ПоказатьПредупреждение(Новый ОписаниеОповещения("ПриЗаписиЗавершение", ЭтотОбъект), НСтр(Текст), 60);
			#КонецЕсли
			Возврат;
		КонецЕсли;
		НовыйНабор.СтатусВыполнения = СтатусВыполнения;
		НаборДанных.Записать();
		мСтатусВыполнения = СтатусВыполнения;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписиЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроведения".
Процедура ОбработкаПроведения(Отказ, РежимЗаписи, РежимПроведения)
	
	Перем СтруктураШапкиДокумента;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	
	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбеспеченияПроведенияДокумента

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	СтруктураОбязательныхПолей = Новый Структура("Организация, Подразделение, ОбъектУчета, ОтветственныйЗаВыполнение");
	
	//  Вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры

// Процедура выполняет движения по регистрам.
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ДвиженияРасходМатериалов = Движения.бит_РасходМатериаловПоВыполненнымРаботам;
	
	ТЗРабот = Работы.Выгрузить(,"Работа, Количество");
	ТЗРабот.Свернуть("Работа", "Количество");
	
	Для Каждого ТекСтрокаРаботы Из ТЗРабот Цикл
		
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Работа", ТекСтрокаРаботы.Работа);
		
		СтрокиРасхода = НарядЗаказ.НайтиСтроки(ПараметрыПоиска);
		
		Для Каждого ТекСтрока Из СтрокиРасхода Цикл
			
			НовоеДвижение = ДвиженияРасходМатериалов.Добавить();
			НовоеДвижение.Период = СтруктураШапкиДокумента.Дата;
			НовоеДвижение.Организация     = СтруктураШапкиДокумента.Организация;
			НовоеДвижение.Подразделение   = СтруктураШапкиДокумента.Подразделение;
			НовоеДвижение.Объект     	  = СтруктураШапкиДокумента.ОбъектУчета;
			НовоеДвижение.КатегорияРабот  = СтруктураШапкиДокумента.КатегорияРабот;
			НовоеДвижение.Номенклатура    = ТекСтрока.Номенклатура;
			НовоеДвижение.Работа          = ТекСтрокаРаботы.Работа;
			
			НовоеДвижение.КоличествоРабот = ТекСтрокаРаботы.Количество;
			НовоеДвижение.КоличествоПлан  = ТекСтрока.КоличествоПлан;
			НовоеДвижение.СуммаПлан       = ТекСтрока.СуммаПлан;
			
			Если СтруктураШапкиДокумента.СтатусВыполнения = Справочники.бит_СтатусыВыполнения.Выполнено Тогда
				НовоеДвижение.КоличествоФакт  = ТекСтрока.Количество;
				НовоеДвижение.СуммаФакт       = ТекСтрока.Сумма;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	СтатусВыполнения = Справочники.бит_СтатусыВыполнения.НоваяЗаявка;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
